# https://github.com/Homebrew/homebrew-bundle
# Copy this file to $HOME/Brewfile
# `brew bundle` installs all the formulae / upgrades the formulae if one is available
# `brew bundle check --force` uninstalls / installs formulae to match this file

tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"

# Homebrew installed packages
# =================================
brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "coreutils"
brew "diff-so-fancy"
brew "findutils", args: ["with-default-names"]
brew "fish"
brew "flow"
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "hugo"
brew "lastpass-cli", args: ["--with-pinentry --with-doc"]
brew "mas" # ^1
brew "python2"
brew "python3"
brew "the_silver_searcher" # ^2
brew "ssh-copy-id"
brew "tree"
brew "vim", args: ["with-override-system-vi", "with-python3"]
brew "watchman"
brew "wget"
brew "yarn", args: ["without-node"]
brew "youtube-dl"
brew "ffmpeg", args: ["--with-libass --with-fontconfig"] # ^3
brew "imagemagick", args: ["--with-fontconfig"] # ^3
brew "giflossy" # ^3

# brew-cask installed Applications
# =================================
cask_args appdir: "/Applications"
cask "adobe-acrobat-reader"
cask "alfred"
cask "chrome-devtools"
cask "dash"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "hyper"
cask "intellij-idea"
cask "iterm2"
cask "kindle"
cask "macvim"
cask "now"
cask "pycharm-ce"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "vlc"
cask "visual-studio-code"

# brew-cask installed Fonts
# =================================
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask "font-source-code-pro"
cask "font-fira-code"

# macOS App Store Apps
# =================================
mas "Dashlane", id: 552383089
mas "LastPass", id: 926036361
mas "Todoist", id: 585829637
mas "Twitter", id: 409789998
#mas "Spark", id: 1176895641
#mas "Xcode", id: 497799835


# =================================

# 1: install macOS App Store apps
#  : `mas install <app>`

# 2: http://geoff.greer.fm/ag
#  : usage: ag [FILE-TYPE] [OPTIONS] PATTERN [PATH]

# 3: https://github.com/vvo/gifify |
#  : npm install -g gifify
