# https://github.com/Homebrew/homebrew-bundle
# mv ~/.brewfile to ~/Brewfile in order to run any `brew bundle` command

# Install all formulae listed in ~/Brewfile
# $ brew bundle

# Output a list of any installed Homebrew formulae not listed in Brewfile:
# $ brew bundle cleanup

# Pass the --force option to this command to uninstall these formulae:
# $ brew bundle cleanup --force

# Homebrew Taps
# ===================================
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "martido/brew-graph"
tap "sass/sass"

# Homebrew installed packages
# ===================================
brew "bash"
brew "bash-completion"
brew "brew-cask-completion"
brew "brew-graph" #1
brew "coreutils"
brew "diff-so-fancy"
brew "fish"
brew "git"
brew "graphviz" #1
brew "hub"
brew "lastpass-cli", args: ["with-pinentry"]
brew "mas" #2
brew "mongodb"
brew "python"
brew "sass/sass/sass"
brew "the_silver_searcher" #3
brew "tree"
brew "trash"
brew "vim"
brew "wget"
brew "yarn", args: ["ignore-dependencies"]
brew "youtube-dl"
# brew "findutils", args: ["with-default-names"]


# Usage
# ===================================
#1 $ brew graph --installed --highlight-leaves | fdp -Tpng -ograph.png && open graph.png
#1 $ open graph.png
#2 https://github.com/mas-cli/mas
#3 http://geoff.greer.fm/ag
#3 $ ag [FILE-TYPE] [OPTIONS] PATTERN [PATH]

# Homebrew installed macOS Applications
# =====================================
cask_args appdir: "/Applications"
cask "alfred"
cask "carbon-copy-cloner"
cask "dash"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "graphql-playground"
cask "hyper"
cask "iterm2"
cask "kindle"
cask "launchrocket"
cask "mongodb-compass"
cask "now"
cask "slack"
cask "spotify"
cask "vlc"
cask "visual-studio-code"

# Homebrew installed fonts
# ===================================
cask "font-source-code-pro"
cask "font-fira-code"
cask "font-hack"

# macOS App Store Apps
# ===================================
mas "GIPHY CAPTURE", id: 668208984
mas "Spark", id: 1176895641
mas "LastPass", id: 926036361
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "SpeedTest", id: 1153157709

