# https://github.com/Homebrew/homebrew-bundle

# Install all formulae listed in ~/Brewfile
# $ brew bundle

# Output a list of any installed Homebrew formulae not listed in Brewfile:
# $ brew bundle cleanup

# Pass the --force option to this command to uninstall these formulae:
# $ brew bundle cleanup --force

# Homebrew Taps
# ===================================
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "sass/sass"

# Homebrew installed packages
# ===================================
brew "bash"
brew "bash-completion"
brew "brew-cask-completion"
brew "coreutils"
brew "diff-so-fancy"
brew "fish"
brew "git"
brew "graphviz"
brew "hub"
brew "lastpass-cli", args: ["with-pinentry"]
brew "mas" #https://github.com/mas-cli/mas
brew "python"
brew "speedtest-cli"
brew "tomcat"
brew "tree"
brew "trash"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "heroku/brew/heroku"
brew "sass/sass/sass"

# Usage
# ===================================
#1 $ brew graph --installed --highlight-leaves | fdp -Tpng -ograph.png && open graph.png

# Homebrew installed macOS Applications
# =====================================
cask_args appdir: "/Applications"
cask "alfred"
cask "carbon-copy-cloner"
cask "dash"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "graphql-playground"
cask "hyper"
cask "iterm2"
cask "kindle"
cask "launchrocket"
cask "mongodb-compass"
cask "now"
cask "slack"
cask "spotify"
cask "sqlitestudio"
cask "vlc"
cask "visual-studio-code"

# Homebrew installed fonts
# ===================================
cask "font-source-code-pro"
cask "font-fira-code"
cask "font-hack"

# macOS App Store Apps
# ===================================
mas "ColorSlurp", id: 1287239339
mas "GIPHY CAPTURE", id: 668208984
mas "LastPass", id: 926036361
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
