# https://github.com/Homebrew/homebrew-bundle
# $ `brew bundle` | installs all formulae listed in ~/Brewfile
# $ `brew bundle cleanup` | lists all installed formulae not in Brewfile
# $ `brew bundle cleanup --force` | removes installed formulae not in Brewfile

# Homebrew Taps
# ===================================
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Homebrew installed packages
# ===================================
brew "bash"
brew "bash-completion@2"   # https://formulae.brew.sh/formula/bash-completion@2
brew "coreutils"
brew "diff-so-fancy"       # https://github.com/so-fancy/diff-so-fancy
brew "fish"
brew "git"
brew "hub"                 # https://hub.github.com/
brew "mas"                 # https://github.com/mas-cli/mas
brew "postgres"
brew "pipenv"
brew "python"              # https://docs.brew.sh/Homebrew-and-Python
brew "speedtest-cli"
brew "tree"
brew "trash"
brew "vim"
brew "wget"                # https://www.gnu.org/software/wget/manual/wget.html
brew "youtube-dl"          # https://github.com/ytdl-org/youtube-dl
brew "heroku/brew/heroku"  # https://devcenter.heroku.com/articles/heroku-cli

# Homebrew installed macOS Applications
# =====================================
cask_args appdir: "/Applications"
cask "alfred"
cask "bfxr"                   # https://www.bfxr.net/
cask "db-browser-for-sqlite"
cask "carbon-copy-cloner"
cask "dash"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "graphql-playground"
cask "hyper"
cask "insomnia"
cask "iterm2"
cask "kindle"
cask "love"                   # https://love2d.org/
cask "mongodb-compass"
cask "now"
cask "postman"
cask "slack"
cask "spotify"
cask "sqlitestudio"
cask "vlc"
cask "visual-studio-code"

# Homebrew installed fonts
# ===================================
cask "font-source-code-pro"
cask "font-fira-code"
cask "font-hack"

# macOS App Store Apps
# ===================================
mas "GIPHY CAPTURE", id: 668208984
mas "LastPass", id: 926036361
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
